---
kind: property
id: P:Autodesk.Revit.DB.Visual.Metal.MetalType
source: html/15d436a5-b6f5-01b4-96af-8d47b40356df.htm
---
# Autodesk.Revit.DB.Visual.Metal.MetalType Property

The property labeled "Type" from the "Metal" schema.

## Syntax (C#)
```csharp
public static string MetalType { get; }
```

## Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MetalType".